13/data/attachments/e7904182d6423db2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Richard_best_Friend_73129_2</nif:username>
            <nif:friendToBeRequested>soap_friends_b0e9a363-8ee3-4b94-a37a-9758285a8b80</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>